{
  "discussions": [
    {
      "id": "0",
      "title": "I Punctured My Achilles",
      "author": "Podi Tend",
      "body": "Unfortunately, I punctured my achilles last week after I recklessly bumped into a ladder with drill bits (ouch!). I was scared that I may have torn it, so I went to see my doctor. I was so relieved when she told me that nothing was lodged in my foot, and that I only had achilles tendonitis. Hopefully, I can go back to running and parkour in a few months (fingers crossed!).",
      "likes": "0",
      "dislikes": "0",
      "replies": []
    },
    {
      "id": "1",
      "title": "My Tonsils Become Swollen When I Get Sick",
      "author": "Cervi Itis",
      "body": "I always wondered why my tonsils (located towards the back of the throat) got swollen whenever I caught a cold. I recently discovered that tonsils are lymph nodes! Because pathogens often enter the lymphatic system, our bodies send cells (like white blood cells) to lymph nodes to essentially \"ambush\" the invading pathogens. Isn't that so cool?!?! Go my army of lymphocytes!",
      "likes": "0",
      "dislikes": "0",
      "replies": []
    },
    {
      "id": "2",
      "title": "Why Are Red Blood Cells Red?",
      "author": "Rouge Cyte",
      "body": "Everyone knows that erythrocytes (red blood cells) are red (hence, their name), but what exactly gives them their red color? I've been searching frantically for an answer, but the answers online are so confusing. I would greatly appreciate it if someone can simplify it for me.",
      "likes": "0",
      "dislikes": "0",
      "replies": []
    },
    {
      "id": "ea86",
      "title": "Random Discussion 1",
      "author": "Random Author 1",
      "body": "Random content by random author 1",
      "likes": 0,
      "dislikes": 0,
      "replies": []
    },
    {
      "id": "7e74",
      "title": "Random Discussion 2",
      "author": "Random Author 2",
      "body": "Random content by random author 2",
      "likes": 0,
      "dislikes": 0,
      "replies": []
    },
    {
      "id": "4451",
      "title": "Random Discussion 4",
      "author": "Random Author 4",
      "body": "This body was modified using the PATCH request method :)",
      "likes": 0,
      "dislikes": 0,
      "replies": []
    },
    {
      "id": "5da4",
      "title": "Random Discussion 10",
      "author": "Random Author 10",
      "body": "Random content by random author 10",
      "likes": 0,
      "dislikes": 0,
      "replies": []
    }
  ]
}